"""
На вход подается словарь со списком вещей для похода в качестве ключа и их массой max_weight в качестве значения.

Определите какие вещи влезут в рюкзак backpack передав его максимальную грузоподъёмность.

В переменную backpack сохраните словарь {предмет:вес} с вещами в рюкзаке.

В переменную result выведите список, содержащий все возможные варианты backpack. Напечатайте переменную result.

*Верните все возможные варианты комплектации рюкзака.
Пример
На входе:

items = {
    "ключи": 0.3,
    "кошелек": 0.2,
    "телефон": 0.5,
    "зажигалка": 0.1
}
max_weight = 1.0

На выходе:

[{'ключи': 0.3},
 {'кошелек': 0.2},
 {'ключи': 0.3, 'кошелек': 0.2},
 {'телефон': 0.5},
 {'ключи': 0.3, 'телефон': 0.5},
 {'кошелек': 0.2, 'телефон': 0.5},
 {'ключи': 0.3, 'кошелек': 0.2, 'телефон': 0.5},
 {'зажигалка': 0.1},
 {'зажигалка': 0.1, 'ключи': 0.3},
 {'зажигалка': 0.1, 'кошелек': 0.2},
 {'зажигалка': 0.1, 'ключи': 0.3, 'кошелек': 0.2},
 {'зажигалка': 0.1, 'телефон': 0.5},
 {'зажигалка': 0.1, 'ключи': 0.3, 'телефон': 0.5},
 {'зажигалка': 0.1, 'кошелек': 0.2, 'телефон': 0.5},
 {'ключи': 0.3, 'кошелек': 0.2, 'телефон': 0.5}]
"""

items = {
    "ключи": 0.3,
    "кошелек": 0.2,
    "телефон": 0.5,
    "зажигалка": 0.1
}
max_weight = 1.0

backpack = {}
result = []
count = 0

for key, value in items.items():
    if value <= max_weight:
        backpack[key] = value
        result.append(backpack)
        break

print(result)





# for item, weight in items.items():
#     if weight <= max_weight:
#         backpack[item] = weight
#         # max_weight -= weight
#         print(backpack)


# def backpack(items, max_weight):
#     sum = 0
#     backpack = {}
#     result = []
#
#     for key, value in items.items():
#         sum += value
#         if sum <= max_weight:
#             backpack[key] = value
#         else:
#             sum = sum - value
#         result.append(backpack)
#
#     print(result)
#
# backpack(items,max_weight)