"""
Задание №1

Вспомните какие модули вы уже проходили на курсе.
Создайте файл, в котором вы импортируете встроенные
в модуль функции под псевдонимами. (3-7 строк импорта).
"""

from random import randint as rd
from math import sqrt as sq
from os import path as p

print(rd(10, 100))
print(sq(100))
print()
